<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#Aggregating-and-Combining-pandas-DataFrames" data-toc-modified-id="Aggregating-and-Combining-pandas-DataFrames-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>Aggregating and Combining <code>pandas</code> DataFrames</a></span><ul class="toc-item"><li><span><a href="#Learning-Goals" data-toc-modified-id="Learning-Goals-1.1"><span class="toc-item-num">1.1&nbsp;&nbsp;</span>Learning Goals</a></span><ul class="toc-item"><li><span><a href="#Austin-Animal-Center-Data" data-toc-modified-id="Austin-Animal-Center-Data-1.1.1"><span class="toc-item-num">1.1.1&nbsp;&nbsp;</span>Austin Animal Center Data</a></span></li></ul></li><li><span><a href="#Aggregating-over-DataFrames:-.groupby()" data-toc-modified-id="Aggregating-over-DataFrames:-.groupby()-1.2"><span class="toc-item-num">1.2&nbsp;&nbsp;</span>Aggregating over DataFrames: <code>.groupby()</code></a></span><ul class="toc-item"><li><span><a href="#.groups-and-.get_group()" data-toc-modified-id=".groups-and-.get_group()-1.2.1"><span class="toc-item-num">1.2.1&nbsp;&nbsp;</span><code>.groups</code> and <code>.get_group()</code></a></span><ul class="toc-item"><li><span><a href="#Multi-Indexing" data-toc-modified-id="Multi-Indexing-1.2.1.1"><span class="toc-item-num">1.2.1.1&nbsp;&nbsp;</span>Multi-Indexing</a></span></li></ul></li><li><span><a href="#Aggregating" data-toc-modified-id="Aggregating-1.2.2"><span class="toc-item-num">1.2.2&nbsp;&nbsp;</span>Aggregating</a></span></li><li><span><a href="#Exercise" data-toc-modified-id="Exercise-1.2.3"><span class="toc-item-num">1.2.3&nbsp;&nbsp;</span>Exercise</a></span></li></ul></li><li><span><a href="#Pivoting-a-DataFrame" data-toc-modified-id="Pivoting-a-DataFrame-1.3"><span class="toc-item-num">1.3&nbsp;&nbsp;</span>Pivoting a DataFrame</a></span><ul class="toc-item"><li><span><a href="#.pivot_table()" data-toc-modified-id=".pivot_table()-1.3.1"><span class="toc-item-num">1.3.1&nbsp;&nbsp;</span><code>.pivot_table()</code></a></span><ul class="toc-item"><li><span><a href="#Example" data-toc-modified-id="Example-1.3.1.1"><span class="toc-item-num">1.3.1.1&nbsp;&nbsp;</span>Example</a></span></li><li><span><a href="#Back-to-Austin-animals" data-toc-modified-id="Back-to-Austin-animals-1.3.1.2"><span class="toc-item-num">1.3.1.2&nbsp;&nbsp;</span>Back to Austin animals</a></span></li></ul></li><li><span><a href="#Exercise" data-toc-modified-id="Exercise-1.3.2"><span class="toc-item-num">1.3.2&nbsp;&nbsp;</span>Exercise</a></span></li></ul></li><li><span><a href="#Methods-for-Combining-DataFrames:-.join(),-.merge(),-pd.concat()" data-toc-modified-id="Methods-for-Combining-DataFrames:-.join(),-.merge(),-pd.concat()-1.4"><span class="toc-item-num">1.4&nbsp;&nbsp;</span>Methods for Combining DataFrames: <code>.join()</code>, <code>.merge()</code>, <code>pd.concat()</code></a></span><ul class="toc-item"><li><span><a href="#.join()" data-toc-modified-id=".join()-1.4.1"><span class="toc-item-num">1.4.1&nbsp;&nbsp;</span><code>.join()</code></a></span></li><li><span><a href="#.merge()" data-toc-modified-id=".merge()-1.4.2"><span class="toc-item-num">1.4.2&nbsp;&nbsp;</span><code>.merge()</code></a></span></li><li><span><a href="#The-how-Parameter" data-toc-modified-id="The-how-Parameter-1.4.3"><span class="toc-item-num">1.4.3&nbsp;&nbsp;</span>The <code>how</code> Parameter</a></span></li><li><span><a href="#pd.concat()" data-toc-modified-id="pd.concat()-1.4.4"><span class="toc-item-num">1.4.4&nbsp;&nbsp;</span><code>pd.concat()</code></a></span></li></ul></li><li><span><a href="#King-County-Assessments" data-toc-modified-id="King-County-Assessments-1.5"><span class="toc-item-num">1.5&nbsp;&nbsp;</span>King County Assessments</a></span><ul class="toc-item"><li><span><a href="#First,-get-the-data!" data-toc-modified-id="First,-get-the-data!-1.5.1"><span class="toc-item-num">1.5.1&nbsp;&nbsp;</span>First, get the data!</a></span></li><li><span><a href="#Exercise" data-toc-modified-id="Exercise-1.5.2"><span class="toc-item-num">1.5.2&nbsp;&nbsp;</span>Exercise</a></span></li></ul></li><li><span><a href="#Time-Permitting:-Data-Cleaning-with-Pandas" data-toc-modified-id="Time-Permitting:-Data-Cleaning-with-Pandas-1.6"><span class="toc-item-num">1.6&nbsp;&nbsp;</span>Time Permitting: Data Cleaning with Pandas</a></span><ul class="toc-item"><li><span><a href="#1.-Investigate-and-drop-rows-with-invalid-values-in-the-SalePrice-and-SqFtTotLiving-columns." data-toc-modified-id="1.-Investigate-and-drop-rows-with-invalid-values-in-the-SalePrice-and-SqFtTotLiving-columns.-1.6.1"><span class="toc-item-num">1.6.1&nbsp;&nbsp;</span>1. Investigate and drop rows with invalid values in the SalePrice and SqFtTotLiving columns.</a></span></li><li><span><a href="#2.-Investigate-and-handle-non-numeric-ZipCode-values" data-toc-modified-id="2.-Investigate-and-handle-non-numeric-ZipCode-values-1.6.2"><span class="toc-item-num">1.6.2&nbsp;&nbsp;</span>2. Investigate and handle non-numeric ZipCode values</a></span></li><li><span><a href="#3.-Add-a-column-for-PricePerSqFt" data-toc-modified-id="3.-Add-a-column-for-PricePerSqFt-1.6.3"><span class="toc-item-num">1.6.3&nbsp;&nbsp;</span>3. Add a column for PricePerSqFt</a></span></li><li><span><a href="#4.-Subset-the-data-to-2021-sales-only." data-toc-modified-id="4.-Subset-the-data-to-2021-sales-only.-1.6.4"><span class="toc-item-num">1.6.4&nbsp;&nbsp;</span>4. Subset the data to 2021 sales only.</a></span></li><li><span><a href="#5.-What-is-the-mean-price-per-square-foot-for-a-house-sold-in-Seattle-in-2021?" data-toc-modified-id="5.-What-is-the-mean-price-per-square-foot-for-a-house-sold-in-Seattle-in-2021?-1.6.5"><span class="toc-item-num">1.6.5&nbsp;&nbsp;</span>5. What is the mean price per square foot for a house sold in Seattle in 2021?</a></span></li></ul></li><li><span><a href="#Level-Up:-pandas.set_option()" data-toc-modified-id="Level-Up:-pandas.set_option()-1.7"><span class="toc-item-num">1.7&nbsp;&nbsp;</span>Level Up: <code>pandas.set_option()</code></a></span><ul class="toc-item"><li><span><a href="#Block-Scientific-Notation" data-toc-modified-id="Block-Scientific-Notation-1.7.1"><span class="toc-item-num">1.7.1&nbsp;&nbsp;</span>Block Scientific Notation</a></span></li><li><span><a href="#See-More-Rows" data-toc-modified-id="See-More-Rows-1.7.2"><span class="toc-item-num">1.7.2&nbsp;&nbsp;</span>See More Rows</a></span></li></ul></li></ul></li></ul></div>

# Aggregating and Combining `pandas` DataFrames

In [2]:
import pandas as pd
import numpy as np
import requests as rq
from sklearn.preprocessing import OneHotEncoder
from zipfile import ZipFile

## Learning Goals

- Use GroupBy objects to organize and aggregate data
- Create pivot tables from DataFrames
- Combine DataFrames by merging and appending

We'll work with the Austin Animal Center dataset and with data from King County's Department of Assessments (Seattle housing data).

### Austin Animal Center Data

In [3]:
data = rq.get('https://data.austintexas.gov/resource/9t4d-g238.json').text

In [4]:
animals = pd.read_json(data)

In [5]:
animals.head()

,animal_id,name,datetime,monthyear,date_of_birth,outcome_type,animal_type,sex_upon_outcome,age_upon_outcome,breed,color,outcome_subtype
0,A855896,*Ingrid,2022-06-11 19:15:00,2022-06-11T19:15:00.000,2020-10-25T00:00:00.000,Adoption,Dog,Spayed Female,1 year,Pit Bull,White/Black,NaN
1,A856845,NaN,2022-06-11 18:54:00,2022-06-11T18:54:00.000,2022-04-13T00:00:00.000,Adoption,Cat,Neutered Male,1 month,Domestic Shorthair,Brown Tabby/White,NaN
2,A858011,Diamond,2022-06-11 17:38:00,2022-06-11T17:38:00.000,2020-05-24T00:00:00.000,Adoption,Dog,Intact Female,2 years,Pit Bull Mix,Tricolor/Fawn,NaN
3,A838126,Chop,2022-06-11 17:31:00,2022-06-11T17:31:00.000,2019-07-03T00:00:00.000,Adoption,Dog,Neutered Male,2 years,Labrador Retriever/Pit Bull,Black,NaN
4,A858973,Koda,2022-06-11 17:15:00,2022-06-11T17:15:00.000,2020-06-07T00:00:00.000,Adoption,Dog,Neutered Male,2 years,Great Pyrenees Mix,White/Brown,NaN

## Aggregating over DataFrames: `.groupby()`

Those of you familiar with SQL have probably used the GROUP BY command. (And if you haven't, you'll see it very soon!) Pandas has this, too.

The `.groupby()` method is especially useful for aggregate functions applied to the data grouped in particular ways.

In [6]:
animals.groupby('animal_type')

In [7]:
animals.columns

Index(['animal_id', 'name', 'datetime', 'monthyear', 'date_of_birth',
       'outcome_type', 'animal_type', 'sex_upon_outcome', 'age_upon_outcome',
       'breed', 'color', 'outcome_subtype'],
      dtype='object')

We can group by multiple columns, and also return a DataFrameGroupBy object

Notice the object type [DataFrameGroupBy](https://pandas.pydata.org/pandas-docs/stable/user_guide/groupby.html) object.

### `.groups` and `.get_group()`

In [8]:
animals.groupby(['animal_type', 'outcome_type'])

In [9]:
# This retuns each group indexed by the group name: I.E. 'Bird', along with the row indices of each value
animals.groupby('animal_type').groups

{'Bird': [196, 424, 865], 'Cat': [1, 5, 6, 10, 11, 12, 16, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 30, 32, 33, 38, 41, 42, 47, 48, 50, 51, 52, 53, 55, 56, 57, 58, 59, 60, 61, 62, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 79, 82, 83, 90, 91, 92, 93, 94, 95, 97, 103, 106, 107, 108, 110, 111, 115, 117, 119, 157, 159, 160, 161, 162, 163, 164, 166, 167, 171, 172, 174, 175, 176, 177, 178, 179, 180, 181, 182, 183, 184, 185, 186, 188, 189, 190, 191, 192, 193, ...], 'Dog': [0, 2, 3, 4, 7, 8, 9, 13, 14, 15, 17, 28, 29, 31, 34, 35, 36, 37, 39, 40, 43, 44, 46, 49, 54, 63, 78, 85, 89, 96, 98, 99, 100, 101, 102, 104, 105, 109, 112, 113, 114, 116, 120, 121, 122, 123, 124, 125, 126, 127, 128, 129, 130, 131, 132, 133, 134, 135, 136, 137, 138, 139, 140, 141, 142, 143, 144, 145, 146, 147, 148, 149, 150, 151, 152, 153, 154, 155, 156, 158, 165, 168, 169, 170, 173, 187, 194, 197, 198, 199, 200, 201, 202, 203, 204, 205, 207, 208, 209, 211, ...], 'Other': [45, 80, 81, 84, 86, 87, 88, 118, 248, 267, 268, 312, 489, 490, 535, 573, 582, 619, 626, 635, 636, 637, 656, 661, 662, 678, 751, 758, 765, 776, 777, 809, 823, 824, 825, 876, 899, 900, 901, 902, 907, 911]}

Once we know we are working with a type of object, it opens up a suite of attributes and methods. One attribute we can look at is groups.

In [10]:
# Once we know the group indices, we can return the groups using those indices.
animals.groupby('animal_type').get_group('Dog')

,animal_id,name,datetime,monthyear,date_of_birth,outcome_type,animal_type,sex_upon_outcome,age_upon_outcome,breed,color,outcome_subtype
0,A855896,*Ingrid,2022-06-11 19:15:00,2022-06-11T19:15:00.000,2020-10-25T00:00:00.000,Adoption,Dog,Spayed Female,1 year,Pit Bull,White/Black,NaN
2,A858011,Diamond,2022-06-11 17:38:00,2022-06-11T17:38:00.000,2020-05-24T00:00:00.000,Adoption,Dog,Intact Female,2 years,Pit Bull Mix,Tricolor/Fawn,NaN
3,A838126,Chop,2022-06-11 17:31:00,2022-06-11T17:31:00.000,2019-07-03T00:00:00.000,Adoption,Dog,Neutered Male,2 years,Labrador Retriever/Pit Bull,Black,NaN
4,A858973,Koda,2022-06-11 17:15:00,2022-06-11T17:15:00.000,2020-06-07T00:00:00.000,Adoption,Dog,Neutered Male,2 years,Great Pyrenees Mix,White/Brown,NaN
7,A837866,Reyna,2022-06-11 16:49:00,2022-06-11T16:49:00.000,2020-06-29T00:00:00.000,Adoption,Dog,Spayed Female,1 year,Pit Bull,Tan,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...
993,A857390,A857390,2022-05-16 16:06:00,2022-05-16T16:06:00.000,2021-12-16T00:00:00.000,Transfer,Dog,Intact Male,4 months,Beagle Mix,Brown Brindle/White,Partner
994,A857200,A857200,2022-05-16 16:06:00,2022-05-16T16:06:00.000,2021-12-13T00:00:00.000,Transfer,Dog,Intact Female,5 months,Pit Bull,Fawn/White,Partner
995,A857391,A857391,2022-05-16 16:05:00,2022-05-16T16:05:00.000,2021-12-16T00:00:00.000,Transfer,Dog,Intact Male,4 months,Cocker Spaniel Mix,Black/White,Partner
996,A857392,A857392,2022-05-16 16:05:00,2022-05-16T16:05:00.000,2021-12-16T00:00:00.000,Transfer,Dog,Intact Male,4 months,Dachshund Mix,Red/White,Partner
999,A857137,A857137,2022-05-16 15:25:00,2022-05-16T15:25:00.000,2018-05-12T00:00:00.000,Transfer,Dog,Intact Female,4 years,German Shepherd,Black/Buff,Partner

#### Multi-Indexing

In [12]:
# Same goes for multi index groupbys
animal_outcome = animals.groupby(['animal_type', 'outcome_type'])
animal_outcome.groups

{('Bird', 'Return to Owner'): [196, 865], ('Bird', 'Transfer'): [424], ('Cat', 'Adoption'): [1, 10, 11, 12, 21, 22, 23, 24, 25, 26, 30, 32, 33, 38, 48, 62, 64, 66, 67, 69, 70, 73, 74, 75, 76, 79, 90, 91, 92, 93, 94, 95, 97, 103, 106, 107, 108, 110, 111, 117, 157, 159, 166, 167, 171, 172, 174, 175, 176, 177, 178, 188, 189, 190, 191, 192, 193, 195, 210, 215, 216, 217, 223, 224, 225, 228, 239, 242, 243, 245, 256, 258, 260, 262, 263, 264, 265, 273, 285, 315, 316, 317, 318, 319, 321, 322, 323, 325, 333, 334, 335, 336, 340, 341, 343, 359, 363, 370, 374, 375, ...], ('Cat', 'Died'): [115, 534, 560, 799, 833], ('Cat', 'Euthanasia'): [16, 27, 61, 65, 68, 231, 390, 401, 500, 517, 568, 621, 800, 897, 898], ('Cat', 'Relocate'): [680], ('Cat', 'Return to Owner'): [206, 230, 391, 504, 618, 646, 672, 826, 883, 884, 951], ('Cat', 'Rto-Adopt'): [47, 71, 72, 429], ('Cat', 'Transfer'): [5, 6, 18, 19, 20, 41, 42, 50, 51, 52, 53, 55, 56, 57, 58, 59, 60, 77, 82, 83, 119, 160, 161, 162, 163, 164, 179, 180, 181, 182, 183, 184, 185, 186, 213, 226, 227, 232, 233, 234, 235, 236, 237, 238, 240, 241, 249, 269, 270, 271, 282, 304, 326, 327, 328, 329, 330, 331, 355, 356, 357, 358, 366, 372, 373, 385, 389, 395, 397, 398, 399, 421, 422, 434, 438, 439, 440, 441, 442, 443, 444, 474, 475, 476, 477, 478, 491, 492, 493, 495, 496, 498, 499, 501, 502, 503, 506, 507, 508, 509, ...], ('Dog', 'Adoption'): [0, 2, 3, 4, 7, 8, 9, 13, 15, 17, 29, 31, 34, 40, 43, 44, 78, 89, 96, 98, 105, 112, 113, 116, 158, 165, 168, 169, 170, 173, 187, 194, 207, 209, 211, 212, 218, 219, 220, 221, 222, 229, 244, 247, 253, 257, 259, 266, 272, 276, 277, 278, 279, 305, 306, 307, 313, 314, 320, 324, 332, 338, 345, 346, 347, 348, 349, 360, 362, 371, 378, 382, 387, 392, 393, 394, 419, 423, 428, 430, 432, 435, 436, 437, 446, 448, 452, 462, 464, 465, 466, 469, 479, 481, 482, 484, 485, 487, 505, 515, ...], ('Dog', 'Euthanasia'): [28, 36, 37, 39, 46, 49, 54, 252, 433, 483, 572, 628, 630, 753, 828, 941], ('Dog', 'Return to Owner'): [35, 63, 85, 114, 197, 208, 214, 246, 250, 251, 261, 275, 303, 308, 309, 310, 337, 350, 368, 369, 404, 405, 406, 407, 408, 409, 431, 453, 454, 455, 463, 494, 497, 522, 553, 554, 556, 559, 581, 584, 606, 608, 633, 634, 642, 645, 648, 651, 652, 669, 718, 744, 745, 774, 790, 792, 812, 829, 887, 894, 905, 938, 940, 947, 964, 969], ('Dog', 'Rto-Adopt'): [311, 583, 605, 805, 806, 886, 920, 932], ('Dog', 'Transfer'): [14, 99, 100, 101, 102, 104, 109, 120, 121, 122, 123, 124, 125, 126, 127, 128, 129, 130, 131, 132, 133, 134, 135, 136, 137, 138, 139, 140, 141, 142, 143, 144, 145, 146, 147, 148, 149, 150, 151, 152, 153, 154, 155, 156, 198, 199, 200, 201, 202, 203, 204, 205, 254, 255, 274, 280, 281, 283, 284, 286, 287, 288, 289, 290, 291, 292, 293, 294, 295, 296, 297, 298, 299, 300, 301, 302, 339, 342, 344, 351, 352, 353, 354, 361, 364, 365, 367, 381, 410, 411, 412, 413, 414, 415, 416, 417, 418, 425, 457, 461, ...], ('Other', 'Adoption'): [268, 312], ('Other', 'Euthanasia'): [45, 80, 81, 84, 86, 87, 88, 118, 248, 267, 489, 490, 535, 573, 582, 619, 626, 635, 636, 637, 656, 751, 765, 776, 777, 809, 876, 899, 900, 901, 902, 907, 911], ('Other', 'Return to Owner'): [758], ('Other', 'Transfer'): [661, 662, 678, 823, 824, 825]}

In [13]:
# animal_outcome.groups is a dictionary, so we can access the group names using keys()
animal_outcome.groups.keys()

dict_keys([('Bird', 'Return to Owner'), ('Bird', 'Transfer'), ('Cat', 'Adoption'), ('Cat', 'Died'), ('Cat', 'Euthanasia'), ('Cat', 'Relocate'), ('Cat', 'Return to Owner'), ('Cat', 'Rto-Adopt'), ('Cat', 'Transfer'), ('Dog', 'Adoption'), ('Dog', 'Euthanasia'), ('Dog', 'Return to Owner'), ('Dog', 'Rto-Adopt'), ('Dog', 'Transfer'), ('Other', 'Adoption'), ('Other', 'Euthanasia'), ('Other', 'Return to Owner'), ('Other', 'Transfer')])

In [14]:
# We can then get a specific group, such as Cats that were adopted
animal_outcome.get_group(('Cat', 'Adoption'))

,animal_id,name,datetime,monthyear,date_of_birth,outcome_type,animal_type,sex_upon_outcome,age_upon_outcome,breed,color,outcome_subtype
1,A856845,NaN,2022-06-11 18:54:00,2022-06-11T18:54:00.000,2022-04-13T00:00:00.000,Adoption,Cat,Neutered Male,1 month,Domestic Shorthair,Brown Tabby/White,NaN
10,A857243,Pixie,2022-06-11 15:43:00,2022-06-11T15:43:00.000,2019-11-13T00:00:00.000,Adoption,Cat,Spayed Female,2 years,Domestic Shorthair,Brown Tabby,NaN
11,A856973,*Suede,2022-06-11 15:39:00,2022-06-11T15:39:00.000,2021-05-10T00:00:00.000,Adoption,Cat,Spayed Female,1 year,Domestic Medium Hair,Blue,NaN
12,A856959,*Ginger,2022-06-11 15:39:00,2022-06-11T15:39:00.000,2022-03-07T00:00:00.000,Adoption,Cat,Spayed Female,3 months,Domestic Medium Hair Mix,Blue,NaN
21,A856311,*Honeycomb,2022-06-11 14:09:00,2022-06-11T14:09:00.000,2020-05-02T00:00:00.000,Adoption,Cat,Spayed Female,2 years,Domestic Shorthair,Tortie,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...
981,A857150,*Joan Of Arcadia,2022-05-16 17:38:00,2022-05-16T17:38:00.000,2022-03-12T00:00:00.000,Adoption,Cat,Spayed Female,2 months,Domestic Shorthair,Torbie,NaN
987,A856864,*Trina,2022-05-16 16:52:00,2022-05-16T16:52:00.000,2022-03-09T00:00:00.000,Adoption,Cat,Neutered Male,2 months,Domestic Shorthair,Orange Tabby/White,NaN
988,A857149,*Amber,2022-05-16 16:34:00,2022-05-16T16:34:00.000,2022-03-12T00:00:00.000,Adoption,Cat,Spayed Female,2 months,Domestic Shorthair,Torbie,NaN
997,A856867,*Andre,2022-05-16 16:02:00,2022-05-16T16:02:00.000,2022-03-09T00:00:00.000,Adoption,Cat,Neutered Male,2 months,Domestic Shorthair,Orange Tabby/White,NaN
998,A856776,*Igraine,2022-05-16 16:02:00,2022-05-16T16:02:00.000,2022-01-07T00:00:00.000,Adoption,Cat,Spayed Female,4 months,Domestic Shorthair,Black,NaN

### Aggregating

Once again, as we will see in SQL, groupby objects are intended to be used with aggregation. In SQL, we will see that our queries that include GROUP BY require aggregation performed on columns.

We can use `.sum()`, `.mean()`, `.count()`, `.max()`, `.min()`, etc. Find a list of common aggregations [here](https://pandas.pydata.org/pandas-docs/stable/user_guide/groupby.html).

In [16]:
animals.groupby('animal_type').count()

,animal_id,name,datetime,monthyear,date_of_birth,outcome_type,sex_upon_outcome,age_upon_outcome,breed,color,outcome_subtype
animal_type,,,,,,,,,,,
Bird,3,2,3,3,3,3,3,3,3,3,1
Cat,457,366,457,457,457,457,457,457,457,457,261
Dog,498,443,498,498,498,498,498,498,498,498,273
Other,42,17,42,42,42,42,42,42,42,42,37

### Exercise

Use `.groupby()` to find the most recently born of each (main) animal type.

In [20]:
animals.groupby('animal_type')['date_of_birth'].max()

animal_type
Bird     2021-06-03T00:00:00.000
Cat      2022-06-10T00:00:00.000
Dog      2022-05-27T00:00:00.000
Other    2022-06-07T00:00:00.000
Name: date_of_birth, dtype: object

<details>
    <summary>Answer</summary>
    <code>animals.groupby('animal_type')['date_of_birth'].max()</code>
    </details>

## Pivoting a DataFrame

### `.pivot_table()`

Those of you familiar with Excel have probably used Pivot Tables. Pandas has a similar functionality.

Grouping by two different columns can be very helpful.

In [21]:
animals.groupby(by=['outcome_type', 'sex_upon_outcome']).agg(len)

                                  animal_id  name  datetime  monthyear  \
outcome_type    sex_upon_outcome
Adoption        Intact Female             6     6         6          6
                Intact Male               4     4         4          4
                Neutered Male           222   222       222        222
                Spayed Female           228   228       228        228
Died            Intact Female             2     2         2          2
                Intact Male               2     2         2          2
                Unknown                   1     1         1          1
Euthanasia      Intact Female             5     5         5          5
                Intact Male              14    14        14         14
                NULL                      2     2         2          2
                Neutered Male             4     4         4          4
                Spayed Female             4     4         4          4
                Unknown                  35    35        35         35
Relocate        Unknown                   1     1         1          1
Return to Owner Intact Female            14    14        14         14
                Intact Male              26    26        26         26
                Neutered Male            20    20        20         20
                Spayed Female            20    20        20         20
Rto-Adopt       Neutered Male             7     7         7          7
                Spayed Female             5     5         5          5
Transfer        Intact Female           150   150       150        150
                Intact Male             130   130       130        130
                Neutered Male            45    45        45         45
                Spayed Female            36    36        36         36
                Unknown                  17    17        17         17

                                  date_of_birth  animal_type  \
outcome_type    sex_upon_outcome
Adoption        Intact Female                 6            6
                Intact Male                   4            4
                Neutered Male               222          222
                Spayed Female               228          228
Died            Intact Female                 2            2
                Intact Male                   2            2
                Unknown                       1            1
Euthanasia      Intact Female                 5            5
                Intact Male                  14           14
                NULL                          2            2
                Neutered Male                 4            4
                Spayed Female                 4            4
                Unknown                      35           35
Relocate        Unknown                       1            1
Return to Owner Intact Female                14           14
                Intact Male                  26           26
                Neutered Male                20           20
                Spayed Female                20           20
Rto-Adopt       Neutered Male                 7            7
                Spayed Female                 5            5
Transfer        Intact Female               150          150
                Intact Male                 130          130
                Neutered Male                45           45
                Spayed Female                36           36
                Unknown                      17           17

                                  age_upon_outcome  breed  color  \
outcome_type    sex_upon_outcome
Adoption        Intact Female                    6      6      6
                Intact Male                      4      4      4
                Neutered Male                  222    222    222
                Spayed Female                  228    228    228
Died            Intact Female                    2      2      2
                Intact Male                      2      2      2
                Unknown                          1      1      1
Euthanasia      Intact Female                    5      5      5
                Intact Male                     14     14     14
                NULL                             2      2      2
                Neutered Male                    4      4      4
                Spayed Female                    4      4      4
                Unknown                         35     35     35
Relocate        Unknown                          1      1      1
Return to Owner Intact Female                   14     14     14
                Intact Male                     26     26     26
                Neutered Male                   20     20     20
                Spayed Female                   20     20     20
Rto-Adopt       Neutered Male                    7      7      7
                Spayed Female                    5      5      5
Transfer        Intact Female                  150    150    150
                Intact Male                    130    130    130
                Neutered Male                   45     45     45
                Spayed Female                   36     36     36
                Unknown                         17     17     17

                                  outcome_subtype
outcome_type    sex_upon_outcome
Adoption        Intact Female                   6
                Intact Male                     4
                Neutered Male                 222
                Spayed Female                 228
Died            Intact Female                   2
                Intact Male                     2
                Unknown                         1
Euthanasia      Intact Female                   5
                Intact Male                    14
                NULL                            2
                Neutered Male                   4
                Spayed Female                   4
                Unknown                        35
Relocate        Unknown                         1
Return to Owner Intact Female                  14
                Intact Male                    26
                Neutered Male                  20
                Spayed Female                  20
Rto-Adopt       Neutered Male                   7
                Spayed Female                   5
Transfer        Intact Female                 150
                Intact Male                   130
                Neutered Male                  45
                Spayed Female                  36
                Unknown                        17

But it has the unsavory side effect of creating a two-level index. This can be a good time to use `.pivot_table()`.

(There is also a `.pivot()`. For the somewhat subtle differences, see [here](https://stackoverflow.com/questions/30960338/pandas-difference-between-pivot-and-pivot-table-why-is-only-pivot-table-workin).)

#### Example

In [22]:
df = pd.DataFrame({"sex": ["male", "male", "male", "male", "male",
                          "female", "female", "female", "female"],
                    "num_puppies": ["one", "one", "one", "two", "two",
                          "one", "one", "two", "two"],
                    "breed": ["terrier", "retriever", "retriever", "terrier",
                          "terrier", "retriever", "terrier", "terrier",
                          "retriever"],
                    "past_owners": [1, 2, 2, 3, 3, 4, 5, 6, 7],
                    "family_members": [2, 4, 5, 5, 6, 6, 8, 9, 9]})
df

      sex num_puppies      breed  past_owners  family_members
0    male         one    terrier            1               2
1    male         one  retriever            2               4
2    male         one  retriever            2               5
3    male         two    terrier            3               5
4    male         two    terrier            3               6
5  female         one  retriever            4               6
6  female         one    terrier            5               8
7  female         two    terrier            6               9
8  female         two  retriever            7               9

In [23]:
# This first example aggregates values by taking the sum.

table = pd.pivot_table(df, values='past_owners', index=['sex', 'num_puppies'],
                     columns=['breed'], aggfunc=np.sum)
table

breed               retriever  terrier
sex    num_puppies
female one                4.0      5.0
       two                7.0      6.0
male   one                4.0      1.0
       two                NaN      6.0

#### Back to Austin animals

In [24]:
animals.pivot_table(index='outcome_type', columns='sex_upon_outcome', aggfunc=len)

                 age_upon_outcome                                 \
sex_upon_outcome    Intact Female Intact Male NULL Neutered Male
outcome_type
Adoption                      6.0         4.0  NaN         222.0
Died                          2.0         2.0  NaN           NaN
Euthanasia                    5.0        14.0  2.0           4.0
Relocate                      NaN         NaN  NaN           NaN
Return to Owner              14.0        26.0  NaN          20.0
Rto-Adopt                     NaN         NaN  NaN           7.0
Transfer                    150.0       130.0  NaN          45.0

                                           animal_id                   \
sex_upon_outcome Spayed Female Unknown Intact Female Intact Male NULL
outcome_type
Adoption                 228.0     NaN           6.0         4.0  NaN
Died                       NaN     1.0           2.0         2.0  NaN
Euthanasia                 4.0    35.0           5.0        14.0  2.0
Relocate                   NaN     1.0           NaN         NaN  NaN
Return to Owner           20.0     NaN          14.0        26.0  NaN
Rto-Adopt                  5.0     NaN           NaN         NaN  NaN
Transfer                  36.0    17.0         150.0       130.0  NaN

                                ... name                                      \
sex_upon_outcome Neutered Male  ... NULL Neutered Male Spayed Female Unknown
outcome_type                    ...
Adoption                 222.0  ...  NaN         222.0         228.0     NaN
Died                       NaN  ...  NaN           NaN           NaN     1.0
Euthanasia                 4.0  ...  2.0           4.0           4.0    35.0
Relocate                   NaN  ...  NaN           NaN           NaN     1.0
Return to Owner           20.0  ...  NaN          20.0          20.0     NaN
Rto-Adopt                  7.0  ...  NaN           7.0           5.0     NaN
Transfer                  45.0  ...  NaN          45.0          36.0    17.0

                 outcome_subtype                                               \
sex_upon_outcome   Intact Female Intact Male NULL Neutered Male Spayed Female
outcome_type
Adoption                     6.0         4.0  NaN         222.0         228.0
Died                         2.0         2.0  NaN           NaN           NaN
Euthanasia                   5.0        14.0  2.0           4.0           4.0
Relocate                     NaN         NaN  NaN           NaN           NaN
Return to Owner             14.0        26.0  NaN          20.0          20.0
Rto-Adopt                    NaN         NaN  NaN           7.0           5.0
Transfer                   150.0       130.0  NaN          45.0          36.0


sex_upon_outcome Unknown
outcome_type
Adoption             NaN
Died                 1.0
Euthanasia          35.0
Relocate             1.0
Return to Owner      NaN
Rto-Adopt            NaN
Transfer            17.0

[7 rows x 60 columns]

### Exercise

Use `.pivot_table()` to add up the number of my tasks by category. Hint: Use `sum()` as your aggregating function.

In [25]:
tasks = pd.DataFrame({'category': ['house', 'house', 'school', 'school'],
                      'descr': ['kitchen', 'laundry', 'git', 'Python'],
                      'priority': [2, 3, 4, 1], 'num_tasks': [2, 1, 2, 3]})

tasks

  category    descr  priority  num_tasks
0    house  kitchen         2          2
1    house  laundry         3          1
2   school      git         4          2
3   school   Python         1          3

In [28]:
tasks_table = tasks.pivot_table(index='category', columns=None, values='num_tasks', aggfunc='sum')
tasks_table

          num_tasks
category
house             3
school            5

<details>
    <summary>Answer</summary>
    <code>tasks.pivot_table(values='num_tasks', index='category', aggfunc=sum)</code>
    </details>

## Methods for Combining DataFrames: `.join()`, `.merge()`, `pd.concat()`

### `.join()`

In [29]:
toy1 = pd.DataFrame([[63, 142], [33, 47]], columns=['age', 'HP'])
toy2 = pd.DataFrame([[63, 100], [33, 200]], columns=['age', 'MP'])

toy1

   age   HP
0   63  142
1   33   47

In [30]:
toy2

   age   MP
0   63  100
1   33  200

In [31]:
# We can't just join these as they are, since we haven't specified our suffixes.

toy1.join(toy2)

ValueError: columns overlap but no suffix specified: Index(['age'], dtype='object')

In [32]:
toy1.join(toy2, lsuffix='1', rsuffix='2')

   age1   HP  age2   MP
0    63  142    63  100
1    33   47    33  200

If we don't want to keep both, we could set the overlapping column as the index in each DataFrame:

In [33]:
toy1.set_index('age').join(toy2.set_index('age'))

      HP   MP
age
63   142  100
33    47  200

For more on this method, check out the [doc](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.join.html)!

### `.merge()`

Or we could use `.merge()`:

In [34]:
toy1.merge(toy2)

   age   HP   MP
0   63  142  100
1   33   47  200

In [35]:
ds_chars = pd.read_csv('data/ds_chars.csv', index_col=0)
ds_chars

     name   HP home_state
0    greg  200         WA
1   miles  200         WA
2    alan  170         TX
3  alison  300         DC
4  rachel  200         TX

In [37]:
states = pd.read_csv('data/states.csv', index_col=0)
states

  state   nickname     capital
0    WA  evergreen     Olympia
1    TX      alamo      Austin
2    DC   district  Washington
3    OH    buckeye    Columbus
4    OR     beaver       Salem

### The `how` Parameter

This parameter in both `.join()` and `.merge()` tells the compiler what sort of join to effect. We'll cover this in detail when we discuss SQL.

In [38]:
ds_chars.merge(states,
               left_on='home_state',
               right_on='state',
               how='inner')

     name   HP home_state state   nickname     capital
0    greg  200         WA    WA  evergreen     Olympia
1   miles  200         WA    WA  evergreen     Olympia
2    alan  170         TX    TX      alamo      Austin
3  rachel  200         TX    TX      alamo      Austin
4  alison  300         DC    DC   district  Washington

In [39]:
ds_chars.merge(states,
               left_on='home_state',
               right_on='state',
               how='outer')

     name     HP home_state state   nickname     capital
0    greg  200.0         WA    WA  evergreen     Olympia
1   miles  200.0         WA    WA  evergreen     Olympia
2    alan  170.0         TX    TX      alamo      Austin
3  rachel  200.0         TX    TX      alamo      Austin
4  alison  300.0         DC    DC   district  Washington
5     NaN    NaN        NaN    OH    buckeye    Columbus
6     NaN    NaN        NaN    OR     beaver       Salem

### `pd.concat()`

This method takes a *list* of pandas objects as arguments.

In [40]:
ds_full = pd.concat([ds_chars, states])
ds_full

     name     HP home_state state   nickname     capital
0    greg  200.0         WA   NaN        NaN         NaN
1   miles  200.0         WA   NaN        NaN         NaN
2    alan  170.0         TX   NaN        NaN         NaN
3  alison  300.0         DC   NaN        NaN         NaN
4  rachel  200.0         TX   NaN        NaN         NaN
0     NaN    NaN        NaN    WA  evergreen     Olympia
1     NaN    NaN        NaN    TX      alamo      Austin
2     NaN    NaN        NaN    DC   district  Washington
3     NaN    NaN        NaN    OH    buckeye    Columbus
4     NaN    NaN        NaN    OR     beaver       Salem

`pd.concat()`–– and many other pandas operations –– make use of an `axis` parameter. For this particular method I need to specify whether I want to concatenate the DataFrames *row-wise* (`axis=0`) or *column-wise* (`axis=1`). The default is `axis=0`, so let's override that!

In [41]:
ds_full = pd.concat([ds_chars, states], axis=1)
ds_full

     name   HP home_state state   nickname     capital
0    greg  200         WA    WA  evergreen     Olympia
1   miles  200         WA    TX      alamo      Austin
2    alan  170         TX    DC   district  Washington
3  alison  300         DC    OH    buckeye    Columbus
4  rachel  200         TX    OR     beaver       Salem

## King County Assessments

As data scientists, we want to build a model to predict the sale price of a house in Seattle in 2019, based on its square footage. We know that the King County Department of Assessments has comprehensive data available on real property sales in the Seattle area. We need to prepare the data.

### First, get the data!

Go [here](https://info.kingcounty.gov/assessor/DataDownload/default.aspx) and download two files: "Real Property Sales" and "Residential Building". Then unzip them. (Or you can run the cells below if you prefer.)

In [ ]:
# %%bash
# cd data
# curl -o property_sales.zip https://aqua.kingcounty.gov/extranet/assessor/Real%20Property%20Sales.zip

In [ ]:
# %%bash
# cd data
# curl -o res_bldg.zip https://aqua.kingcounty.gov/extranet/assessor/Residential%20Building.zip

In [ ]:
# zf = ZipFile('data/property_sales.zip', 'r')
# zf.extractall('data')
# zf.close()

In [ ]:
# zf = ZipFile('data/res_bldg.zip', 'r')
# zf.extractall('data')
# zf.close()

In [ ]:
# You'll need to use a new encoding here. List of all encodings here:
# https://docs.python.org/3/library/codecs.html#standard-encodings

# Both of these csv files have many columns, so we'll just pre-select
# which ones we want to use.

sales_df = pd.read_csv('/Users/gdamico/Downloads/EXTR_RPSale.csv',
                       encoding='latin-1',
                       usecols=['Major', 'Minor', 'DocumentDate', 'SalePrice'])

In [ ]:
sales_df.info()

In [ ]:
bldg_df = pd.read_csv('~/Downloads/EXTR_ResBldg.csv',
                     usecols=['Major', 'Minor', 'SqFtTotLiving', 'ZipCode'])

In [ ]:
bldg_df.info()

In [ ]:
sales_data = pd.merge(sales_df, bldg_df, on=['Major', 'Minor'])

In [ ]:
sales_data.head()

In [ ]:
sales_data.info()

We can see right away that we're missing ZIP codes for many of the sales transactions.

In [ ]:
sales_data.loc[sales_data['ZipCode'].isna()].head()

### Exercise

What percentage of housing records are missing ZIP codes?

<details>
    <summary>Answer</summary>
    <code>sales_data['ZipCode'].isna().sum() / sales_data.shape[0]</code>
    </details>

Let's drop the rows with missing zip codes.

In [ ]:
sales_data = sales_data.loc[~sales_data['ZipCode'].isna(), :]

sales_data.head()

## Time Permitting: Data Cleaning with Pandas

### 1. Investigate and drop rows with invalid values in the SalePrice and SqFtTotLiving columns.

<details>
    <summary>One possible answer here</summary>
    <code>sales_data = sales_data[sales_data['SalePrice'] > 10000]</code>
    </details>

### 2. Investigate and handle non-numeric ZipCode values

Can you find a way to shorten ZIP+4 codes to the first five digits?

In [ ]:
def is_integer(x):
    try:
        _ = int(x)
    except ValueError:
        return False
    return True

sales_data.loc[sales_data['ZipCode'].apply(is_integer) == False, 'ZipCode'].head()

<details>
    <summary>One possible answer here</summary>
    <code>def five_digit_ZIP(x):
    try:
        return int(str(x)[:5])
    except:
        return x
sales_data['ZipCode'] = sales_data['ZipCode'].map(five_digit_ZIP)
sales_data = sales_data.loc[sales_data['ZipCode'].apply(is_integer) == True, :]
sales_data['ZipCode'] = sales_data['ZipCode'].map(int)</code>
    </details>

### 3. Add a column for PricePerSqFt

<details>
    <summary>Answer here</summary>
    <code>sales_data['PricePerSqFt'] = sales_data['SalePrice'] / sales_data['SqFtTotLiving']</code>
    </details>

### 4. Subset the data to 2021 sales only.

We can assume that the DocumentDate is approximately the sale date.

<details>
    <summary>Answer here</summary>
    <code>sales_data['DocumentDate'] = pd.to_datetime(sales_data['DocumentDate'])
sales_data = sales_data.loc[sales_data['DocumentDate'] > '12/31/2020']</code>
    </details>

### 5. What is the mean price per square foot for a house sold in Seattle in 2021?

<details>
    <summary>Answer here</summary>
    <code>sales_data['PricePerSqFt'].mean()</code>
    </details>

## Level Up: `pandas.set_option()`

We can adjust how `pandas` works by setting options in advance.

### Block Scientific Notation

For example, suppose we want to prevent numbers from being displayed in scientific notation.

In [ ]:
df = pd.DataFrame([[1e9, 2e9], [3e9, 4e9]])
df

Then we can use:

In [ ]:
pd.set_option('display.float_format', '{:.2f}'.format)

df

### See More Rows

Or suppose we want `pandas` to show more rows.

In [ ]:
df2 = pd.DataFrame(np.array(range(100)))
df2

In that case we can use:

In [ ]:
pd.set_option('display.max_rows', 100)

df2

For complete documentation, see [here](https://pandas.pydata.org/pandas-docs/stable/user_guide/options.html).